MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1024EFM100/mcu.h
extern volatile __LATGbits_t LATGbits __asm__ ("LATG") __attribute__((section("sfrs"), address(0xBF860630)));
extern volatile uint32_t        LATGCLR __attribute__((section("sfrs"),address(0xBF860634)));
extern volatile uint32_t        LATGSET __attribute__((section("sfrs"),address(0xBF860638)));
extern volatile uint32_t        LATGINV __attribute__((section("sfrs"),address(0xBF86063C)));
#define ODCG ODCG
extern volatile uint32_t   ODCG __attribute__((section("sfrs"), address(0xBF860640)));
typedef union {
  struct {
    uint32_t ODCG0:1;
    uint32_t ODCG1:1;
    uint32_t :4;
    uint32_t ODCG6:1;
    uint32_t ODCG7:1;
    uint32_t ODCG8:1;
    uint32_t ODCG9:1;
    uint32_t :2;
    uint32_t ODCG12:1;
    uint32_t ODCG13:1;
    uint32_t ODCG14:1;
    uint32_t ODCG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __ODCGbits_t;
extern volatile __ODCGbits_t ODCGbits __asm__ ("ODCG") __attribute__((section("sfrs"), address(0xBF860640)));
extern volatile uint32_t        ODCGCLR __attribute__((section("sfrs"),address(0xBF860644)));
extern volatile uint32_t        ODCGSET __attribute__((section("sfrs"),address(0xBF860648)));
extern volatile uint32_t        ODCGINV __attribute__((section("sfrs"),address(0xBF86064C)));
#define CNPUG CNPUG
extern volatile uint32_t   CNPUG __attribute__((section("sfrs"), address(0xBF860650)));
typedef union {
  struct {
    uint32_t CNPUG0:1;
    uint32_t CNPUG1:1;
    uint32_t :4;
    uint32_t CNPUG6:1;
    uint32_t CNPUG7:1;
    uint32_t CNPUG8:1;
    uint32_t CNPUG9:1;
    uint32_t :2;
    uint32_t CNPUG12:1;
    uint32_t CNPUG13:1;
    uint32_t CNPUG14:1;
    uint32_t CNPUG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPUGbits_t;
extern volatile __CNPUGbits_t CNPUGbits __asm__ ("CNPUG") __attribute__((section("sfrs"), address(0xBF860650)));
extern volatile uint32_t        CNPUGCLR __attribute__((section("sfrs"),address(0xBF860654)));
extern volatile uint32_t        CNPUGSET __attribute__((section("sfrs"),address(0xBF860658)));
extern volatile uint32_t        CNPUGINV __attribute__((section("sfrs"),address(0xBF86065C)));
#define CNPDG CNPDG
extern volatile uint32_t   CNPDG __attribute__((section("sfrs"), address(0xBF860660)));
typedef union {
  struct {
    uint32_t CNPDG0:1;
    uint32_t CNPDG1:1;
    uint32_t :4;
    uint32_t CNPDG6:1;
    uint32_t CNPDG7:1;
    uint32_t CNPDG8:1;
    uint32_t CNPDG9:1;
    uint32_t :2;
    uint32_t CNPDG12:1;
    uint32_t CNPDG13:1;
    uint32_t CNPDG14:1;
    uint32_t CNPDG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNPDGbits_t;
extern volatile __CNPDGbits_t CNPDGbits __asm__ ("CNPDG") __attribute__((section("sfrs"), address(0xBF860660)));
extern volatile uint32_t        CNPDGCLR __attribute__((section("sfrs"),address(0xBF860664)));
extern volatile uint32_t        CNPDGSET __attribute__((section("sfrs"),address(0xBF860668)));
extern volatile uint32_t        CNPDGINV __attribute__((section("sfrs"),address(0xBF86066C)));
#define CNCONG CNCONG
extern volatile uint32_t   CNCONG __attribute__((section("sfrs"), address(0xBF860670)));
typedef union {
  struct {
    uint32_t :11;
    uint32_t EDGEDETECT:1;
    uint32_t :3;
    uint32_t ON:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNCONGbits_t;
extern volatile __CNCONGbits_t CNCONGbits __asm__ ("CNCONG") __attribute__((section("sfrs"), address(0xBF860670)));
extern volatile uint32_t        CNCONGCLR __attribute__((section("sfrs"),address(0xBF860674)));
extern volatile uint32_t        CNCONGSET __attribute__((section("sfrs"),address(0xBF860678)));
extern volatile uint32_t        CNCONGINV __attribute__((section("sfrs"),address(0xBF86067C)));
#define CNENG CNENG
extern volatile uint32_t   CNENG __attribute__((section("sfrs"), address(0xBF860680)));
typedef union {
  struct {
    uint32_t CNIEG0:1;
    uint32_t CNIEG1:1;
    uint32_t :4;
    uint32_t CNIEG6:1;
    uint32_t CNIEG7:1;
    uint32_t CNIEG8:1;
    uint32_t CNIEG9:1;
    uint32_t :2;
    uint32_t CNIEG12:1;
    uint32_t CNIEG13:1;
    uint32_t CNIEG14:1;
    uint32_t CNIEG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNENGbits_t;
extern volatile __CNENGbits_t CNENGbits __asm__ ("CNENG") __attribute__((section("sfrs"), address(0xBF860680)));
extern volatile uint32_t        CNENGCLR __attribute__((section("sfrs"),address(0xBF860684)));
extern volatile uint32_t        CNENGSET __attribute__((section("sfrs"),address(0xBF860688)));
extern volatile uint32_t        CNENGINV __attribute__((section("sfrs"),address(0xBF86068C)));
#define CNSTATG CNSTATG
extern volatile uint32_t   CNSTATG __attribute__((section("sfrs"), address(0xBF860690)));
typedef union {
  struct {
    uint32_t CNSTATG0:1;
    uint32_t CNSTATG1:1;
    uint32_t :4;
    uint32_t CNSTATG6:1;
    uint32_t CNSTATG7:1;
    uint32_t CNSTATG8:1;
    uint32_t CNSTATG9:1;
    uint32_t :2;
    uint32_t CNSTATG12:1;
    uint32_t CNSTATG13:1;
    uint32_t CNSTATG14:1;
    uint32_t CNSTATG15:1;
  };
  struct {
    uint32_t w:32;
  };
} __CNSTATGbits_t;
extern volatile __CNSTATGbits_t CNSTATGbits __asm__ ("CNSTATG") __attribute__((section("sfrs"), address(0xBF860690)));
extern volatile uint32_t        CNSTATGCLR __attribute__((section("sfrs"),address(0xBF860694)));
extern volatile uint32_t        CNSTATGSET __attribute__((section("sfrs"),address(0xBF860698)));
extern volatile uint32_t        CNSTATGINV __attribute__((section("sfrs"),address(0xBF86069C)));
#define CNNEG CNNEG
extern volatile uint32_t   CNNEG __attribute__((section("sfrs"), address(0xBF8606A0)));
typedef struct {
  uint32_t CNNEG0:1;
  uint32_t CNNEG1:1;
  uint32_t :4;
  uint32_t CNNEG6:1;
  uint32_t CNNEG7:1;
  uint32_t CNNEG8:1;
  uint32_t CNNEG9:1;
  uint32_t :2;
  uint32_t CNNEG12:1;
  uint32_t CNNEG13:1;
  uint32_t CNNEG14:1;
  uint32_t CNNEG15:1;
} __CNNEGbits_t;
extern volatile __CNNEGbits_t CNNEGbits __asm__ ("CNNEG") __attribute__((section("sfrs"), address(0xBF8606A0)));
extern volatile uint32_t        CNNEGCLR __attribute__((section("sfrs"),address(0xBF8606A4)));
extern volatile uint32_t        CNNEGSET __attribute__((section("sfrs"),address(0xBF8606A8)));
extern volatile uint32_t        CNNEGINV __attribute__((section("sfrs"),address(0xBF8606AC)));
#define CNFG CNFG
extern volatile uint32_t   CNFG __attribute__((section("sfrs"), address(0xBF8606B0)));
typedef struct {
  uint32_t CNFG0:1;
  uint32_t CNFG1:1;
  uint32_t :4;
  uint32_t CNFG6:1;
  uint32_t CNFG7:1;
  uint32_t CNFG8:1;
  uint32_t CNFG9:1;
  uint32_t :2;
  uint32_t CNFG12:1;
  uint32_t CNFG13:1;
  uint32_t CNFG14:1;
  uint32_t CNFG15:1;
} __CNFGbits_t;
extern volatile __CNFGbits_t CNFGbits __asm__ ("CNFG") __attribute__((section("sfrs"), address(0xBF8606B0)));
extern volatile uint32_t        CNFGCLR __attribute__((section("sfrs"),address(0xBF8606B4)));
extern volatile uint32_t        CNFGSET __attribute__((section("sfrs"),address(0xBF8606B8)));
extern volatile uint32_t        CNFGINV __attribute__((section("sfrs"),address(0xBF8606BC)));
#define SRCON0G SRCON0G
extern volatile uint32_t   SRCON0G __attribute__((section("sfrs"), address(0xBF8606C0)));
typedef struct {
  uint32_t :6;
  uint32_t SR0G6:1;
  uint32_t :2;
  uint32_t SR0G9:1;
  uint32_t :2;
  uint32_t SR0G12:1;
  uint32_t SR0G13:1;
  uint32_t SR0G14:1;
} __SRCON0Gbits_t;
extern volatile __SRCON0Gbits_t SRCON0Gbits __asm__ ("SRCON0G") __attribute__((section("sfrs"), address(0xBF8606C0)));
extern volatile uint32_t        SRCON0GCLR __attribute__((section("sfrs"),address(0xBF8606C4)));
extern volatile uint32_t        SRCON0GSET __attribute__((section("sfrs"),address(0xBF8606C8)));
extern volatile uint32_t        SRCON0GINV __attribute__((section("sfrs"),address(0xBF8606CC)));
#define SRCON1G SRCON1G
extern volatile uint32_t   SRCON1G __attribute__((section("sfrs"), address(0xBF8606D0)));
typedef struct {
  uint32_t :6;
  uint32_t SR1G6:1;
  uint32_t :2;
  uint32_t SR1G9:1;
  uint32_t :2;
  uint32_t SR1G12:1;
  uint32_t SR1G13:1;
  uint32_t SR1G14:1;
} __SRCON1Gbits_t;
extern volatile __SRCON1Gbits_t SRCON1Gbits __asm__ ("SRCON1G") __attribute__((section("sfrs"), address(0xBF8606D0)));
extern volatile uint32_t        SRCON1GCLR __attribute__((section("sfrs"),address(0xBF8606D4)));
extern volatile uint32_t        SRCON1GSET __attribute__((section("sfrs"),address(0xBF8606D8)));
extern volatile uint32_t        SRCON1GINV __attribute__((section("sfrs"),address(0xBF8606DC)));
#define C1CON C1CON
extern volatile uint32_t   C1CON __attribute__((section("sfrs"), address(0xBF880000)));
typedef union {
  struct {
    uint32_t DNCNT:5;
    uint32_t :6;
    uint32_t CANBUSY:1;
    uint32_t :1;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t :4;
    uint32_t CANCAP:1;
    uint32_t OPMOD:3;
    uint32_t REQOP:3;
    uint32_t ABAT:1;
  };
  struct {
    uint32_t w:32;
  };
} __C1CONbits_t;
